In [ ]:
import pandas as pd
from sqlalchemy import create_engine
import pymysql

]@#2@J5,KzV8dr;
DB_NAME = "myapp_db"
DB_HOST = "127.0.0.1"
DB_USER = "app_user"
DB_PASS = "appuserpassword456"
DB_PORT = 3306

connection_string = f'mysql+pymysql://{DB_USER}:{DB_PASS}@{DB_HOST}:{DB_PORT}/{DB_NAME}'
engine = create_engine(connection_string)

sql_query = "SELECT * FROM products;"
df = pd.read_sql(sql_query, engine)
df

   product_id                 name   price  stock_quantity
0           1           Laptop Pro  1200.0              50
1           2  Mechanical Keyboard    75.5             150
2           3       Wireless Mouse    25.0             300
3           4           4K Monitor   350.0              80

In [7]:
sql = '''
SELECT name, price,
price * 0.9 AS reduced_price
FROM products
'''

pd.read_sql(sql, engine)

                  name   price  reduced_price
0           Laptop Pro  1200.0        1080.00
1  Mechanical Keyboard    75.5          67.95
2       Wireless Mouse    25.0          22.50
3           4K Monitor   350.0         315.00

In [8]:
sql = '''
SELECT name, 
price,
ROUND(price * 0.00047, 2) AS process_fee
FROM products
'''

pd.read_sql(sql, engine)

                  name   price  process_fee
0           Laptop Pro  1200.0         0.56
1  Mechanical Keyboard    75.5         0.04
2       Wireless Mouse    25.0         0.01
3           4K Monitor   350.0         0.16

In [9]:
sql = '''
SELECT CONCAT(first_name,' ', last_name) AS customer_name
FROM customers;
'''
pd.read_sql(sql, engine)

   customer_name
0  Alice Johnson
1      Bob Smith
2  Charlie Brown
3    Dana Scully

In [10]:
sql = '''
SELECT * FROM customers
WHERE first_name < 'Bob';
'''
pd.read_sql(sql, engine)

,customer_id,first_name,last_name,email,phone_number,city,registration_date
0,1,Alice,Johnson,alice.johnson@corp.com,None,New York,2025-09-30 17:44:17